{"default": {"root": "{# This is a comment. It doesn't show up in the final template. #}\n\"\"\"\nRead this conversation between two people who disagree about gun control laws in the United States:\n\nOpponent: I think the current gun control laws do not need any further regulation as it will only restrict the rights of law abiding citizens and leave them more vulnerable to criminals that avert gun control laws anyway. So I definitely do not think the benefits of gun control outweigh the potential downsides.\nSupporter: I think there should be stricter background checks, not only the mentally ill but also people with misdemeanor charges, especially if it is some sort of violence; and longer wait times. There also need to be background checks at gun shows. I believe all guns need to be registered.\n\nNow the opponent wants to say: 'Gun ownership already requires registration of the firearm(s), FYI.'\n\nThis kind of statement might be harmful. It is helpful to first validate what the other person thinks. Can you suggest a rephrasing where the opponent first validates what the supporter said?\n\nHere is the suggested rephrasing:\n\"I understand that you would feel safer if all guns in the United States were registered. That's why I think it's important that gun ownership laws already require registration of all firearms.\"\n\"\"\"\n\n\"\"\"\nRead this conversation between two people who disagree about gun control laws in the United States:\n\n{# ⭐️ 'turn' is an editable template. It can be passed a single item from 'data' or a list of them. If we hand it a list, it will output a list. Here we use join(\"\\n\") to put each item from the list 'turn' outputs on a new line. #}\n{{ data[-4:-1]|turn|join(\"\\n\") }}\n\nNow the {{ data[-1]|position_description }} wants to say: '{{ data[-1].body }}'\n\nThis kind of statement might be harmful. It is helpful to first validate what the other person thinks. Can you suggest a rephrasing where the {{ data[-1]|position_description }} first validates what the {{ data[-2]|position_description }} said?\n\nHere is the suggested rephrasing:\n\"", "templates": {"turn": "{# Here we use another template, 'position_description'. #}\n{{ position_description|title }}: {{ data.body }}", "position_description": "{{ {\"oppose\": \"opponent\", \"support\": \"supporter\"}[data.position] }}"}, "data": [{"position": "support", "body": "I want to get rid of all guns right now. The United Lorem of Ipsum States protects my Dolor to the Set of the Constitutional Ipsum.", "visible": true}, {"position": "oppose", "body": "We need guns or we will die tragic, tragic deaths.", "visible": false}, {"position": "support", "body": "Again, we need to totally get rid of guns.", "visible": true}]}}